## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.neo4j will be updated in-place
  ~ resource "aws_ecs_service" "neo4j" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/neo4j/neo4j"
        name                               = "neo4j"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:1" -> (known after apply)
        # (14 unchanged attributes hidden)





        # (6 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.neo4j must be replaced
-/+ resource "aws_ecs_task_definition" "neo4j" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ image            = "neo4j:sha256:aabe1e6e19a8582d7fd9a42f7317b0e260e7870ce3e6b4dacffb2f7d6d141a31" -> "neo4j@sha256:aabe1e6e19a8582d7fd9a42f7317b0e260e7870ce3e6b4dacffb2f7d6d141a31"
                  - mountPoints      = [] -> null
                    name             = "neo4j"
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "neo4j" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-cloud-asset-inventory"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
